<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input1" type="Parameter" version="opset1">
			<data shape="1,1,64,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_1747" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 97" offset="0" size="388" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>97</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_1746" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="388" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_1745" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1412" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="FeatureExtraction.ConvNet.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 3, 3" offset="2436" size="1152" />
			<output>
				<port id="0" precision="FP32" names="FeatureExtraction.ConvNet.0.weight">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_47" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3588" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="46">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="47">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="MaxPool_2" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="48">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="FeatureExtraction.ConvNet.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="3716" size="73728" />
			<output>
				<port id="0" precision="FP32" names="FeatureExtraction.ConvNet.3.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_64" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="77444" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="49">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="50">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MaxPool_5" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="51">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="FeatureExtraction.ConvNet.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="77700" size="294912" />
			<output>
				<port id="0" precision="FP32" names="FeatureExtraction.ConvNet.6.weight">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_81" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="372612" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="52">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="53">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="FeatureExtraction.ConvNet.8.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="373124" size="589824" />
			<output>
				<port id="0" precision="FP32" names="FeatureExtraction.ConvNet.8.weight">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_97" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="962948" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="54">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="55">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="MaxPool_10" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="56">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="361" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="963460" size="1179648" />
			<output>
				<port id="0" precision="FP32" names="361">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_114" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2143108" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="360">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_12" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="59">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="364" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="2144132" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="364">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_130" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="4503428" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="363">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="62">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MaxPool_15" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="63">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="FeatureExtraction.ConvNet.18.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 2, 2" offset="4504452" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="FeatureExtraction.ConvNet.18.weight">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_147" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5553028" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="65">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_152" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="5554052" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_18" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="66">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="AveragePool_19" type="AvgPool" version="opset1">
			<data kernel="1, 3" strides="1, 3" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="67">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_155" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554084" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Squeeze_20" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="68">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_165" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5554092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="366" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554096" size="8" />
			<output>
				<port id="0" precision="I64" names="366">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Shape_21" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="69">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_1654" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_159" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="Gather_23" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="75">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="367" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554112" size="8" />
			<output>
				<port id="0" precision="I64" names="367">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Concat_25" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="77">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="ConstantOfShape_26" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_220" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_221" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_177" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5554092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="368" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554096" size="8" />
			<output>
				<port id="0" precision="I64" names="368">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_1660" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Gather_230" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="82">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="369" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554112" size="8" />
			<output>
				<port id="0" precision="I64" names="369">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Concat_28" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="84">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ConstantOfShape_29" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="85">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_222" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Transpose_223" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ShapeOf_196" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_200" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554144" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_197" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554092" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Gather_201" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_198" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554092" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Gather_199" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Broadcast_213" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Concat_192" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024, 256" offset="5554148" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Concat_195" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024, 256" offset="7651300" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Concat_212" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024" offset="9748452" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="LSTMSequence_231" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="256" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_1681" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9756644" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Transpose_32" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_33" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="9756676" size="24" />
			<output>
				<port id="0" precision="I64" names="207">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_34" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_244" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Transpose_35" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_1707" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="9756700" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="MatMul_36" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Add_37" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_256" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5554092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="89" name="414" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554096" size="8" />
			<output>
				<port id="0" precision="I64" names="414">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Shape_38" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="213">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_1666" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_250" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="Gather_40" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="219">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="415" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554112" size="8" />
			<output>
				<port id="0" precision="I64" names="415">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Concat_42" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="221">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="ConstantOfShape_43" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="222">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_311" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Transpose_312" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_268" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5554092" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="416" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554096" size="8" />
			<output>
				<port id="0" precision="I64" names="416">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_1672" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554104" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Gather_400" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="226">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="417" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5554112" size="8" />
			<output>
				<port id="0" precision="I64" names="417">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Concat_45" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="228">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="ConstantOfShape_46" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="229">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_313" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Transpose_314" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="ShapeOf_287" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_291" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554144" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_288" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554092" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Gather_292" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_289" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="5554092" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Gather_290" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Broadcast_304" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Concat_283" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024, 256" offset="10280988" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Concat_286" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024, 256" offset="12378140" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Concat_303" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1024" offset="14475292" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="LSTMSequence_322" type="LSTMSequence" version="opset5">
			<data direction="bidirectional" hidden_size="256" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_1683" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9756644" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Transpose_49" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="350">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_50" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="9756676" size="24" />
			<output>
				<port id="0" precision="I64" names="351">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Reshape_51" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="352">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_335" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5554120" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Transpose_52" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="353">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_1711" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512" offset="14483484" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="MatMul_53" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Add_54" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="356">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_1715" type="Const" version="opset1">
			<data element_type="f32" shape="97, 256" offset="15007772" size="99328" />
			<output>
				<port id="0" precision="FP32">
					<dim>97</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="MatMul_55" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>97</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="358">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>97</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="output" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>97</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>97</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>97</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>97</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="130" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="127" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="87" to-port="0" />
