<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="input1" type="Parameter" version="opset1">
			<data shape="1,1,64,320" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_2210" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 97" offset="0" size="388" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>97</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_2205" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="388" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="1412" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2136" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_2137" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2440" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_2138" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_2139" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2440" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="DequantizeLinear_input1_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_input1_1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="FeatureExtraction.ConvNet.0.weight" type="Const" version="opset1">
			<data element_type="i8" shape="32, 1, 3, 3" offset="2444" size="288" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Convert_2410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_2308" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2732" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="DequantizeLinear_FeatureExtraction.ConvNet.0.weight_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_FeatureExtraction.ConvNet.0.weight_1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_113" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="2736" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="46">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_2144" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_2145" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2864" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_2146" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_2147" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2864" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="DequantizeLinear_47_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_47_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MaxPool_2" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="48">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="FeatureExtraction.ConvNet.3.weight" type="Const" version="opset1">
			<data element_type="i8" shape="64, 32, 3, 3" offset="2868" size="18432" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Convert_2564" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_2462" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21300" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="DequantizeLinear_FeatureExtraction.ConvNet.3.weight_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_FeatureExtraction.ConvNet.3.weight_1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_160" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="21304" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="49">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_2152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_2153" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21560" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_2154" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_2155" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="21560" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="DequantizeLinear_50_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_50_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MaxPool_5" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="51">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="FeatureExtraction.ConvNet.6.weight" type="Const" version="opset1">
			<data element_type="i8" shape="128, 64, 3, 3" offset="21564" size="73728" />
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Convert_2718" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_2616" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="95292" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="DequantizeLinear_FeatureExtraction.ConvNet.6.weight_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_FeatureExtraction.ConvNet.6.weight_1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_207" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="95296" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="52">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_2160" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_2161" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="95808" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_2162" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_2163" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="95808" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="DequantizeLinear_53_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_53_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="FeatureExtraction.ConvNet.8.weight" type="Const" version="opset1">
			<data element_type="i8" shape="128, 128, 3, 3" offset="95812" size="147456" />
			<output>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Convert_2872" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_2770" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="243268" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="DequantizeLinear_FeatureExtraction.ConvNet.8.weight_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_FeatureExtraction.ConvNet.8.weight_1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_253" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="243272" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="54">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_2168" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_2169" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="243784" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_2170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_2171" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="243784" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="DequantizeLinear_55_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_55_1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MaxPool_10" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="56">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="361" type="Const" version="opset1">
			<data element_type="i8" shape="256, 128, 3, 3" offset="243788" size="294912" />
			<output>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Convert_3026" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_2924" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="538700" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="DequantizeLinear_361_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_361_1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_300" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="538704" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="360">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_2176" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_2177" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="539728" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_2178" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_2179" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="539728" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="DequantizeLinear_59_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_59_1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="364" type="Const" version="opset1">
			<data element_type="i8" shape="256, 256, 3, 3" offset="539732" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Convert_3180" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_3078" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1129556" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="DequantizeLinear_364_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_364_1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1129560" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="363">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_2184" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_2185" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1130584" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_2186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_2187" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1130584" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="DequantizeLinear_62_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_62_1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="MaxPool_15" type="MaxPool" version="opset8">
			<data strides="2, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="63">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="FeatureExtraction.ConvNet.18.weight" type="Const" version="opset1">
			<data element_type="i8" shape="256, 256, 2, 2" offset="1130588" size="262144" />
			<output>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Convert_3334" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_3232" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1392732" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="DequantizeLinear_FeatureExtraction.ConvNet.18.weight_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dq_output_FeatureExtraction.ConvNet.18.weight_1">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_393" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1392736" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_2192" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_2193" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1393760" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_2194" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_2195" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1393760" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="DequantizeLinear_65_1" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="dq_output_65_1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_413" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1393764" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Transpose_18" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="66">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="AveragePool_19" type="AvgPool" version="opset1">
			<data kernel="1, 3" strides="1, 3" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="67">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_416" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393796" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Squeeze_20" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="68">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_426" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="103" name="366" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393804" size="8" />
			<output>
				<port id="0" precision="I64" names="366">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Shape_21" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>79</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="69">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_2038" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393812" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_420" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1393812" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="107" name="Gather_23" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="75">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="367" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393820" size="8" />
			<output>
				<port id="0" precision="I64" names="367">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Concat_25" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="77">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="ConstantOfShape_26" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_469" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1393828" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Transpose_470" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_434" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2436" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="368" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393804" size="8" />
			<output>
				<port id="0" precision="I64" names="368">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_2044" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393812" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Gather_230" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="82">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="369" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1393820" size="8" />
			<output>
				<port id="0" precision="I64" names="369">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Concat_28" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="84">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="ConstantOfShape_29" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="85">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_471" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1393828" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Transpose_472" type="Transpose" version="opset1">
			<input>
